
## :white_check_mark: Apply Succeeded (shareable-lists-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/31491)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.archive_file.sqs-event-consumer_lambda_lambda-default-file_E6B572A9: Reading...
data.archive_file.sqs-event-consumer_lambda_lambda-default-file_E6B572A9: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Refreshing state... [id=pocket-shareablelistsapi-prod-synthetic-checks]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z0060536173N0A80LTF4N]
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/4b6f50cd-5dae-4c50-95e2-2971a3b3a154]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_codedeploy_app.sqs-event-consumer_lambda-code-deploy_code-deploy-app_71E01125: Refreshing state... [id=3897f2b0-8707-4f8f-bbe0-fca352c182c0:ShareableListsApi-Prod-Sqs-Event-Consumer-Lambda]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=shareablelistsapi-prod-app]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
aws_s3_bucket.sqs-event-consumer_lambda_code-bucket_DA349A4E: Refreshing state... [id=pocket-shareablelistsapi-prod-sqs-event-consumer]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ShareableListsApi-Prod/ecs/app]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue-Deadletter]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.terraform_remote_state.incident_management: Read complete after 0s
data.aws_kms_alias.kms_alias: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=9f6ff8a7-12f2-4fb6-a7b0-6ae0fa50c80c:ShareableListsApi-Prod-ECS]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=996905175585]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Critical]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
aws_sqs_queue.user-events-sns-subscription_sns-topic-dql_E3EC76B2: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-SNS-Topic-DLQ]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=Z2BHWTOWFVNW3M]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Reading...
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/ShareableListsApi-Prod]
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_execution-policy-document_B0A73C46: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Read complete after 0s [id=2690255455]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_execution-policy-document_B0A73C46: Read complete after 0s [id=2591764522]
data.aws_iam_policy_document.sqs-event-consumer_lambda_assume-policy-document_1A8910CF: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_AA58E6EB: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_AA58E6EB: Read complete after 1s [id=4250039221]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 1s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 1s [id=/Shared/PrivateSubnets]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=shareablelistsapi-prod-app]
data.aws_iam_policy_document.sqs-event-consumer_lambda_assume-policy-document_1A8910CF: Read complete after 1s [id=1349007126]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PXZPLVP]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 1s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ShareableListsApi-Prod-TaskExecutionRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ShareableListsApi-Prod-TaskRole]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z0060536173N0A80LTF4N__bb46f6bf33036d9eb94adcf17a642085.shareablelistsapi.readitlater.com._CNAME]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PU01KFM]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ShareableListsApi-Prod-ECSCodeDeployRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=2675189396]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=4054665180]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Read complete after 0s [id=2678327256]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Refreshing state... [id=pocket-shareablelistsapi-prod-synthetic-checks]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_0D24AF25: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=Z2BHWTOWFVNW3M_shareablelistsapi.readitlater.com_NS]
data.aws_iam_policy_document.user-events-sns-subscription_sns-dlq-policy-document_ACCD2981: Reading...
aws_s3_bucket_ownership_controls.sqs-event-consumer_lambda_code-bucket-ownership-controls_E3CCA008: Refreshing state... [id=pocket-shareablelistsapi-prod-sqs-event-consumer]
aws_iam_role.synthetics_synthetic_check_role_A3A5C38B: Refreshing state... [id=pocket-shareablelistsapi-prod-synthetic-check]
aws_s3_bucket_public_access_block.sqs-event-consumer_lambda_code-bucket-public-access-block_BB3EE815: Refreshing state... [id=pocket-shareablelistsapi-prod-sqs-event-consumer]
data.aws_iam_policy_document.user-events-sns-subscription_sns-dlq-policy-document_ACCD2981: Read complete after 0s [id=3547599890]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/a2f4b152e723ec2e072749a68dc6a2f39f9ffff4]
aws_iam_policy.sqs-event-consumer_lambda_execution-policy_4069CEFE: Refreshing state... [id=arn:aws:iam::996905175585:policy/ShareableListsApi-Prod-Sqs-Event-Consumer-ExecutionRolePolicy]
aws_iam_role.sqs-event-consumer_lambda_execution-role_971EF5C2: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-ExecutionRole]
aws_iam_role.sqs-event-consumer_lambda-code-deploy_code-deploy-role_9A627C46: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-CodeDeployRole]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/ShareableListsApi-Prod-TaskExecutionRolePolicy]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/ShareableListsApi-Prod-TaskRolePolicy]
aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849: Refreshing state... [id=arn:aws:iam::996905175585:policy/pocket-shareablelistsapi-prod-synthetic-check-access]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-867638e3]
aws_sns_topic_subscription.user-events-sns-subscription_EE3E7438: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:f577c3c5-86de-474b-b8d2-db669bce4375]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 1s [id=vpc-867638e3]
data.aws_iam_policy_document.user-events-sns-subscription_sns-sqs-policy-document_6AABE7B6: Reading...
data.aws_iam_policy_document.user-events-sns-subscription_sns-sqs-policy-document_6AABE7B6: Read complete after 0s [id=3384772170]
data.aws_iam_policy_document.sqs-event-consumer_lambda_sqs_policy_D5A5EF19: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_sqs_policy_D5A5EF19: Read complete after 0s [id=322022527]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ShareableListsApi-Prod-ECSCodeDeployRole-2023020618400834090000000b]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ShareableListsApi-Prod-TaskExecutionRole-20230206184008125100000009]
aws_sqs_queue_policy.user-events-sns-subscription_sns-dlq-policy_CF731C06: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-SNS-Topic-DLQ]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=P85B7NO]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=PSRN8C1]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=POEM7MB]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=P4WQ6XL]
aws_s3_bucket_acl.sqs-event-consumer_lambda_code-bucket-acl_8FA13E85: Refreshing state... [id=pocket-shareablelistsapi-prod-sqs-event-consumer,private]
data.aws_vpc.rds_vpc_9E5B9996: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_vpc.redis_vpc_45DE3471: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/SLAPIg20230206184007519100000007/0fa26693fa982ad1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/SLAPIb20230206184007265200000004/24e274b59ba8b3c3]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-026ed6907822b8845]
aws_sqs_queue_policy.user-events-sns-subscription_sns-sqs-policy_C14BCCA0: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue]
aws_iam_policy.sqs-event-consumer_sqs-policy_9FE8B4E1: Refreshing state... [id=arn:aws:iam::996905175585:policy/ShareableListsApi-Prod-Sqs-Event-Consumer-LambdaSQSPolicy]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
aws_iam_role_policy_attachment.sqs-event-consumer_lambda_execution-role-policy-attachment_B4842CE7: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-ExecutionRole-20230424152508902400000001]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ShareableListsApi-Prod-TaskExecutionRole-2023020618400826970000000a]
data.aws_vpc.rds_vpc_9E5B9996: Read complete after 0s [id=vpc-867638e3]
aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559: Refreshing state... [id=pocket-shareablelistsapi-prod-synthetic-check-20230531140441320700000001]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
aws_codedeploy_deployment_group.sqs-event-consumer_lambda-code-deploy_code-deployment-group_35D3D807: Refreshing state... [id=9f282b2f-667e-4232-a3fc-9483e5699132]
aws_iam_role_policy_attachment.sqs-event-consumer_lambda-code-deploy_code-deploy-policy-attachment_5F4F021D: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-CodeDeployRole-20230424152508923200000002]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ShareableListsApi-Prod-TaskRole-20230206184007780200000008]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Critical:50ebe021-2a5a-4c67-afbc-574cd81d65ba]
data.aws_vpc.redis_vpc_45DE3471: Read complete after 0s [id=vpc-867638e3]
aws_db_subnet_group.rds_rds_subnet_group_796D20B7: Refreshing state... [id=shareablelistsapi-prod20230207160217213400000001]
aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2: Refreshing state... [id=shareablelistsapi-prod-elasticachesubnetgroup]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Non-Critical:7c4736e6-9b8f-4dd8-a9f7-17f57aa3cb8a]
aws_lambda_function.sqs-event-consumer_lambda_477DAF53: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-Function]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B: Refreshing state... [id=slapi-prod-query-0]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Refreshing state... [id=slapi-prod-uptime-0]
aws_security_group.rds_rds_security_group_B7738CEB: Refreshing state... [id=sg-04a9d753d1747f551]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/SLAPI2023020618400918120000000c/8ac043af9d2b4fc1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0ed6d914fcfd795e1]
aws_security_group.redis_elasticache_security_group_24BFB83E: Refreshing state... [id=sg-004ca28a73e69b43e]
aws_iam_role_policy_attachment.sqs-event-consumer_execution-role-policy-attachment_2A5E0086: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-ExecutionRole-20230424152558765300000003]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21: Refreshing state... [id=slapi-prod-query-0]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Refreshing state... [id=slapi-prod-uptime-0]
aws_lambda_alias.sqs-event-consumer_lambda_alias_8B8F9784: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:ShareableListsApi-Prod-Sqs-Event-Consumer-Function:DEPLOYED]
aws_cloudwatch_log_group.sqs-event-consumer_lambda_log-group_A465ADCF: Refreshing state... [id=/aws/lambda/ShareableListsApi-Prod-Sqs-Event-Consumer-Function]
aws_rds_cluster.rds_rds_cluster_1A0399FD: Refreshing state... [id=shareablelistsapi-prod20230207160218618400000003]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Refreshing state... [id=shareablelistsapi-prod]
aws_lambda_event_source_mapping.sqs-event-consumer_lambda_event_source_mapping_5E8B497D: Refreshing state... [id=53e1a37c-fa8d-48c1-80a0-b51ec94735d3]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/SLAPI2023020618400918120000000c/8ac043af9d2b4fc1/39c15541b3ca931a]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z0060536173N0A80LTF4N_shareablelistsapi.readitlater.com_A_1]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/SLAPI2023020618400918120000000c/8ac043af9d2b4fc1/857e2ee02b6d462e]
aws_secretsmanager_secret.rds_rds_secret_A0401B27: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d]
aws_rds_cluster_instance.rds_rds-instance_6675FA88: Refreshing state... [id=shareablelistsapi-prod20230207160218618400000003-serverless]
aws_secretsmanager_secret_version.rds_rds_secret_version_11D8C2B1: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d|3CDBCF7F-D9F6-4417-9BAF-8A6E0C24D2CA]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/SLAPI2023020618400918120000000c/8ac043af9d2b4fc1/857e2ee02b6d462e/b7e8f28d129fe4a0]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=ShareableListsApi-Prod]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=e7b98023a18061e761eb1c8bd3d34e96f59424c5]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/ShareableListsApi-Prod/ShareableListsApi-Prod]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=ShareableListsApi-Prod]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/ShareableListsApi-Prod/ShareableListsApi-Prod]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=74b499d7-30fa-4051-b882-aadc182bb395]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=ShareableListsApi-Prod-ScaleInPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=ShareableListsApi-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=ShareableListsApi-Prod Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=ShareableListsApi-Prod Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ShareableListsApi-Prod:312" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ShareableListsApi-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-prod-app:b950762d0735b24e963bac54aba2c3cb7b774ad2" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-prod-app:805d5dddb9ff057df36c326df15e40b2d56f3e5a"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ShareableListsApi-Prod" -> (known after apply)
      ~ revision                 = 312 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (9 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=ShareableListsApi-Prod]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=ShareableListsApi-Prod]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=5c2e31bfa2a6bc1e588fab24d640f062e4f99d7a]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"4dfebbdf-b3a1-4bf0-a599-5e91e12bf55e","JobName":"shareable-lists-api_infrastructure_apply_prod","PRNumber":128,"Program":"tfcmt","SHA1":"805d5dddb9ff057df36c326df15e40b2d56f3e5a","Target":"shareable-lists-api-cdk","Vars":{}} -->